[
  {
    "id": "FAESUXUU",
    "story": "in-the-forest.md",
    "previously": "Vous avez exploré la clairière et découvert des plantes fascinantes. Un écureuil roux curieux vous a observé de près avant de grimper à un arbre. Finn vous emmène le long du ruisseau, où vous voyez des traces de lapins et d'oiseaux. Vous entendez le doux bruit de l'eau qui coule sur les pierres. Vous suivez le ruisseau jusqu'à sa source, une petite cascade où l'eau tombe dans un bassin clair. Finn vous montre des libellules qui dansent au-dessus de l'eau et des poissons qui nagent tranquillement. Vous vous asseyez près du bassin et profitez de la vue paisible. Finn s'assoit à côté de vous et commence à raconter une histoire sur la cascade. Il parle d'un ancien esprit de l'eau qui protège le ruisseau et aide les animaux à trouver de l'eau fraîche. Vous regardez attentivement l'eau, mais vous ne voyez rien d'inhabituel. Finn vous explique que l'esprit de l'eau est timide et n'apparaît que rarement, surtout aux personnes qui respectent la nature. Vous décidez de continuer votre exploration le long du ruisseau. Finn vous guide vers un autre endroit où l'eau forme un petit lac. Ici, vous voyez des canards et des grenouilles profiter de l'eau calme. Finn vous raconte des histoires sur les animaux qui vivent près du lac et comment ils interagissent avec l'esprit de l'eau. Vous décidez de continuer à explorer le lac. Finn vous guide vers une partie plus profonde du lac où vous voyez des poissons colorés nager. Vous remarquez aussi des plantes aquatiques qui poussent le long des bords du lac. Finn explique l'importance de ces plantes pour les animaux qui vivent dans et autour du lac. Vous vous approchez lentement du bord de l'eau pour observer les poissons de plus près. Finn vous montre comment les poissons se cachent parmi les plantes aquatiques pour échapper aux prédateurs. Vous remarquez des poissons de différentes couleurs et tailles, chacun avec ses propres habitudes et comportements. Finn vous explique comment ces poissons jouent un rôle important dans l'écosystème du lac.",
    "currentStep": {
      "desc": "Vous vous approchez lentement du bord de l'eau pour observer les poissons de plus près. Finn vous montre comment les poissons se cachent parmi les plantes aquatiques pour échapper aux prédateurs. Vous remarquez des poissons de différentes couleurs et tailles, chacun avec ses propres habitudes et comportements. Finn vous explique comment ces poissons jouent un rôle important dans l'écosystème du lac.",
      "options": [
        "Regarder les poissons plus longtemps",
        "Demander à Finn plus d'informations sur les poissons",
        "Continuer à explorer le lac"
      ],
      "action": "continue"
    },
    "nextSteps": [
      {
        "desc": "Vous continuez à observer les poissons, remarquant leurs mouvements gracieux et leurs interactions. Finn vous montre comment certains poissons nettoient les écailles des autres, créant une relation symbiotique. Vous apprenez que chaque poisson a un rôle unique dans le maintien de l'équilibre du lac.",
        "options": [
          "Regarder les poissons plus longtemps",
          "Demander à Finn plus d'informations sur les poissons",
          "Continuer à explorer le lac"
        ],
        "action": "continue"
      },
      {
        "desc": "Vous demandez à Finn plus d'informations sur les poissons. Il vous explique les différentes espèces, leurs habitudes alimentaires et comment elles contribuent à la santé du lac. Vous apprenez que certains poissons mangent des algues, aidant à garder l'eau claire et propre.",
        "options": [
          "Regarder les poissons plus longtemps",
          "Demander à Finn plus d'informations sur les poissons",
          "Continuer à explorer le lac"
        ],
        "action": "continue"
      },
      {
        "desc": "Vous décidez de continuer à explorer le lac. Finn vous guide vers une autre partie du lac où vous voyez des oiseaux aquatiques pêcher. Vous observez comment ils utilisent leurs becs pour attraper des poissons, montrant l'interdépendance des espèces dans l'écosystème du lac.",
        "options": [
          "Regarder les poissons plus longtemps",
          "Demander à Finn plus d'informations sur les poissons",
          "Continuer à explorer le lac"
        ],
        "action": "continue"
      }
    ]
  },
  {
    "id": "ATSAEYDB",
    "story": "in-the-forest.md",
    "previously": "First step.",
    "currentStep": {
      "desc": "Vous vous trouvez dans une petite clairière au cœur d'une forêt enchantée. Des fleurs sauvages de différentes couleurs parsèment l'herbe autour de vos pieds. Un sentier étroit serpente entre les arbres, et vous entendez le doux bruit d'un ruisseau qui coule non loin. Que souhaitez-vous faire ?",
      "options": [
        "Suivre le sentier vers le ruisseau",
        "Explorer les champignons près du grand chêne",
        "Observer les cerfs qui paissent à gauche"
      ],
      "action": "start"
    },
    "nextSteps": [
      {
        "desc": "Vous décidez de suivre le sentier vers le ruisseau. En marchant, vous entendez le bruit de l'eau qui devient de plus en plus fort. Soudain, vous apercevez un renard roux assis près du ruisseau. Il vous regarde avec des yeux brillants et vous salue d'un petit mouvement de la queue. 'Bonjour ! Je m'appelle Finn. Tu veux explorer le ruisseau avec moi ?' dit-il avec un sourire chaleureux.",
        "options": [
          "Accepter l'invitation de Finn",
          "Demander à Finn ce qu'il fait près du ruisseau",
          "Continuer à explorer seul"
        ],
        "action": "continue"
      },
      {
        "desc": "Vous vous approchez des champignons près du grand chêne. Ils sont de différentes tailles et couleurs, certains brillent même légèrement sous la lumière du soleil. En les observant, vous entendez un petit bruit derrière vous. Vous vous retournez et voyez un écureuil roux qui vous regarde curieusement. 'Ces champignons sont magiques, tu sais ?' dit l'écureuil. 'Ils aident les animaux de la forêt à rester en bonne santé.'",
        "options": [
          "Demander à l'écureuil comment les champignons aident les animaux",
          "Ramasser un champignon pour l'examiner de plus près",
          "Continuer à explorer les champignons seul"
        ],
        "action": "continue"
      },
      {
        "desc": "Vous vous approchez silencieusement des cerfs qui paissent. Ils lèvent la tête et vous regardent avec curiosité, mais ne semblent pas effrayés. Un petit faon s'approche de vous et renifle votre main. 'Les cerfs sont très amicaux ici', dit une voix douce derrière vous. Vous vous retournez et voyez un renard roux qui vous sourit. 'Je m'appelle Finn. Tu veux en savoir plus sur les cerfs et leur vie dans la forêt ?'",
        "options": [
          "Accepter l'invitation de Finn",
          "Demander à Finn pourquoi les cerfs ne sont pas effrayés",
          "Continuer à observer les cerfs seul"
        ],
        "action": "continue"
      }
    ]
  },
  {
    "id": "FFNFTQTT",
    "story": "montpellier-medieval.md",
    "previously": "Vous vous retrouvez transporté à Montpellier médiéval, au cœur de la Place de la Comédie. Jean-Jean vous accueille avec un grand sourire. 'Bienvenue à Montpellier !' dit-il. 'Je vends les meilleures pommes de la région. En veux-tu une ?' Il vous tend une pomme rouge et brillante. Vous acceptez la pomme que Jean-Jean vous tend. Elle est juteuse et délicieuse. 'Merci !' dites-vous en souriant. Jean-Jean vous propose de vous montrer les alentours de la ville. Vous demandez à Jean-Jean s'il connaît des moines dans la région. Jean-Jean sourit et dit: 'Bien sûr ! Il y a un monastère près de l'université. Les moines y étudient et prient. Ils sont très sages et pourraient vous apprendre beaucoup de choses.' Il vous propose de vous y rendre ensemble. Vous décidez d'aller au monastère avec Jean-Jean. En chemin, il vous parle des différentes herbes médicinales que les moines cultivent dans leur jardin. Arrivés au monastère, un moine vous accueille chaleureusement et vous montre les anciens manuscrits qu'ils conservent précieusement. Vous remerciez le moine pour son accueil et ses explications. Jean-Jean vous propose de continuer votre exploration de la ville. Vous quittez le monastère et vous dirigez vers le marché animé de Montpellier. Les rues sont remplies de marchands vendant leurs produits, et l'air est rempli de bruits et d'odeurs variées. Vous retournez à la Place de la Comédie, où l'ambiance est toujours aussi animée. Des musiciens jouent de la musique traditionnelle, et des enfants courent autour de la fontaine. Jean-Jean vous propose de vous asseoir sur un banc pour profiter du spectacle. Vous discutez avec les passants et apprenez des anecdotes sur la vie quotidienne à Montpellier.",
    "currentStep": {
      "desc": "Vous retournez à la Place de la Comédie, où l'ambiance est toujours aussi animée. Des musiciens jouent de la musique traditionnelle, et des enfants courent autour de la fontaine. Jean-Jean vous propose de vous asseoir sur un banc pour profiter du spectacle. Vous discutez avec les passants et apprenez des anecdotes sur la vie quotidienne à Montpellier.",
      "options": [
        "Écouter les musiciens",
        "Parler aux enfants",
        "Regarder les passants"
      ],
      "action": "continue"
    },
    "nextSteps": [
      {
        "desc": "Vous vous approchez des musiciens et écoutez leur mélodie envoûtante. Jean-Jean vous explique que ces musiciens viennent de différentes régions et jouent des airs traditionnels. Vous apprenez même quelques pas de danse médiévale !",
        "options": [
          "Continuer à danser",
          "Rejoindre les enfants près de la fontaine",
          "Observer les passants"
        ],
        "action": "continue"
      },
      {
        "desc": "Vous vous approchez des enfants qui jouent près de la fontaine. Ils vous invitent à jouer avec eux à un jeu médiéval appelé 'la marelle'. Vous passez un bon moment à sauter et à rire ensemble.",
        "options": [
          "Continuer à jouer avec les enfants",
          "Écouter les musiciens",
          "Regarder les passants"
        ],
        "action": "continue"
      },
      {
        "desc": "Vous observez les passants et remarquez un groupe de marchands qui discutent animement. Jean-Jean vous explique que ce sont des marchands de soie qui viennent de l'Orient. Ils échangent des histoires et des nouvelles de leurs voyages.",
        "options": [
          "Parler aux marchands",
          "Écouter les musiciens",
          "Rejoindre les enfants"
        ],
        "action": "continue"
      }
    ]
  }
]